agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	/*
	 * Workers / CF publish several IPv4 addresses. Cellular routes can
	 * refuse one address while others work, and nRF DNS can wedge with
	 * -11/errno=115 — so try resolve, then cache, then bootstrap IPs.
	 * Prefer cache/bootstrap early: dual-capture logs show getaddrinfo
	 * failing immediately while Cloudflare anycast still answers TLS.
	 */
	relay_cache_seed_bootstrap();
	ready = ensure_lte_data_ready();
	if (ready != 0) {
		printk("LTE not ready before relay socket: %d\n", ready);
		/* Still attempt DNS/cache; reconnect may have partially worked. */
	}

	/* Fast path when modem DNS is known-bad: cache then bootstrap. */
	if (relay_dns_unreliable) {
		int error;

		printk("Relay DNS marked unreliable — trying cache/bootstrap first\n");
		if (relay_cached_valid) {
			error = try_relay_ipv4(&relay_cached_ip, 0U, 90U,
					       "cache", lat_socket_started,
					       &last_error);
			if (error >= 0) {
				return error;
			}
		}
		error = try_relay_bootstrap_list(0U, lat_socket_started,
						&last_error, true);
		if (error >= 0) {
			return error;
		}
	}

	for (unsigned int attempt = 1U; attempt <= dns_attempts; ++attempt) {
		struct addrinfo *result = NULL;
		int64_t lat_dns_started = k_uptime_get();
		int error = getaddrinfo(RELAY_HOSTNAME, RELAY_PORT,
					&hints, &result);
		int64_t lat_dns_ms = k_uptime_get() - lat_dns_started;
		bool dns_ok = (error == 0 && result != NULL);

		printk("LAT dns_ms=%lld attempt=%u error=%d errno=%d\n",
		       lat_dns_ms, attempt, error, errno);

		if (!dns_ok) {
			printk("Relay DNS attempt %u failed: %d errno=%d "
			       "(EAGAIN/EINPROGRESS often = wedged modem DNS)\n",
			       attempt, error, errno);
			last_error = error != 0 ? -EHOSTUNREACH : -ENOENT;
			relay_dns_unreliable = true;
		} else {
			unsigned int candidate_number = 0U;

			for (struct addrinfo *candidate = result;
			     candidate != NULL; candidate = candidate->ai_next) {
				struct in_addr ip;

				if (candidate->ai_family != AF_INET ||
				    candidate->ai_addr == NULL) {
					continue;
				}
				++candidate_number;
				ip = ((struct sockaddr_in *)candidate->ai_addr)
					     ->sin_addr;
				error = try_relay_ipv4(&ip, attempt,
						       candidate_number, "dns",
						       lat_socket_started,
						       &last_error);
				if (error >= 0) {
					freeaddrinfo(result);
					return error;
				}
			}
		}

		if (result != NULL) {
			freeaddrinfo(result);
		}

		/* After a DNS miss, try cache immediately (seeded bootstrap). */
		if (relay_cached_valid) {
			error = try_relay_ipv4(&relay_cached_ip, attempt, 90U,
					       "cache", lat_socket_started,
					       &last_error);
			if (error >= 0) {
				return error;
			}
		}

		/* First miss: bootstrap before multi-second DNS retries. */
		if (attempt == 1U || !dns_ok) {
			error = try_relay_bootstrap_list(attempt,
							lat_socket_started,
							&last_error, true);
			if (error >= 0) {
				return error;
			}
		}

		/* Once: hard reattach only if cache+bootstrap also failed. */
		if (attempt == 1U && dns_attempts > 1U) {
			printk("Relay DNS/bootstrap failed; forcing LTE reattach\n");
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_OFFLINE);
			k_msleep(500);
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_NORMAL);
			error = lte_lc_connect();
			radio_suspended = false;
			if (error != 0) {
				printk("LTE reattach failed: %d\n", error);
			}
		}

		if (attempt < dns_attempts) {
			k_sleep(K_MSEC(750));
		}
	}

	/* Final pass over every bootstrap IP (including the cached one). */
	{
		int error = try_relay_bootstrap_list(9U, lat_socket_started,
						    &last_error, false);

		if (error >= 0) {
			return error;
		}
	}

	printk("Relay socket open failed: last_error=%d dns_unreliable=%d "
	       "cache_valid=%d\n",
	       last_error, relay_dns_unreliable ? 1 : 0,
	       relay_cached_valid ? 1 : 0);
	return last_error;
}

static int receive_http_response(int fd)
{
	size_t offset = 0U;

	while (offset < sizeof(http_response) - 1U) {
		ssize_t received = recv(fd, http_response + offset,
					sizeof(http_response) - 1U - offset, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			break;
		}
		offset += (size_t)received;
	}
	http_response[offset] = '\0';

	const char *status = strchr(http_response, ' ');

	if (status == NULL) {
		return -EBADMSG;
	}
	pendant_cloud_last_http_status = atoi(status + 1);
	printk("Relay HTTP status: %d, response bytes: %u\n",
	       pendant_cloud_last_http_status, (uint32_t)offset);

	if (pendant_cloud_last_http_status < 200 ||
	    pendant_cloud_last_http_status >= 300) {
		const char *body = strstr(http_response, "\r\n\r\n");

		printk("Relay error: %s\n", body == NULL ? "(no body)" : body + 4);
		return -EREMOTE;
	}

	return 0;
}

static int send_http_post_header(int fd, const char *path,
				 const char *content_type,
				 size_t content_length)
{
	char header[HTTP_HEADER_SIZE];
	int length = snprintf(
		header, sizeof(header),
		"POST %s HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Content-Type: %s\r\n"
		"Content-Length: %lu\r\n"
		"Connection: close\r\n\r\n",
		path, RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		content_type, (unsigned long)content_length);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

/*
 * Chunked raw PCM voice command: one TLS session, HTTP/1.1 Transfer-Encoding
 * chunked, relay wraps s16le → WAV for STT/multimodal + Mac dispatch.
 * Content-Length is unknown at open time so capture can stream live.
 */
static int send_pendant_command_chunked_header(int fd, uint32_t sample_rate)
{
	char header[HTTP_HEADER_SIZE + 128];
	int length = snprintf(
		header, sizeof(header),
		"POST /v1/pendant/command?dispatch=1 HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Content-Type: audio/pcm\r\n"
		"Transfer-Encoding: chunked\r\n"
		"X-Device-Id: %s\r\n"
		"X-Audio-Format: pcm\r\n"
		"X-Sample-Rate: %u\r\n"
		"X-Audio-Channels: 1\r\n"
		"X-Audio-Bits: 16\r\n"
		"Connection: close\r\n\r\n",
		RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		PENDANT_DEVICE_ID, sample_rate);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

/* Known-length fallback for post-capture file upload of raw PCM. */
static int send_pendant_command_pcm_header(int fd, size_t content_length,
					   uint32_t sample_rate)
{
	char header[HTTP_HEADER_SIZE + 128];
	int length = snprintf(
		header, sizeof(header),
		"POST /v1/pendant/command?dispatch=1 HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Content-Type: audio/pcm\r\n"
		"Content-Length: %lu\r\n"
		"X-Device-Id: %s\r\n"
		"X-Audio-Format: pcm\r\n"
		"X-Sample-Rate: %u\r\n"
		"X-Audio-Channels: 1\r\n"
		"X-Audio-Bits: 16\r\n"
		"X-Pcm-Bytes: %lu\r\n"
		"Connection: close\r\n\r\n",
		RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		(unsigned long)content_length, PENDANT_DEVICE_ID, sample_rate,
		(unsigned long)content_length);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

