agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
static int socket_set_nonblock(int fd, bool enable)
{
	int flags = fcntl(fd, F_GETFL, 0);

	if (flags < 0) {
		return -errno;
	}
	if (enable) {
		flags |= O_NONBLOCK;
	} else {
		flags &= ~O_NONBLOCK;
	}
	if (fcntl(fd, F_SETFL, flags) != 0) {
		return -errno;
	}
	return 0;
}

/*
 * Advance non-blocking send of stream_pending. Returns 0 when fully sent,
 * -EAGAIN if more work remains, or a hard error.
 */
static int stream_pending_pump(int64_t deadline_ms)
{
	while (stream_pending_off < stream_pending_len) {
		ssize_t sent;

		if (k_uptime_get() >= deadline_ms) {
			++stream_eagain_count;
			return -EAGAIN;
		}
		sent = send(stream_fd, stream_pending + stream_pending_off,
			    stream_pending_len - stream_pending_off, 0);
		if (sent < 0) {
			if (errno == EINTR) {
				continue;
			}
			if (errno == EAGAIN || errno == EWOULDBLOCK) {
				++stream_eagain_count;
				return -EAGAIN;
			}
			return -errno;
		}
		if (sent == 0) {
			return -ECONNRESET;
		}
		stream_pending_off += (size_t)sent;
	}
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	++stream_chunks_completed;
	return 0;
}

static int stream_queue_http_chunk(const void *data, size_t length)
{
	char chunk_header[16];
	int header_length;
	size_t total;

	if (length == 0U) {
		return 0;
	}
	if (stream_pending_len != 0U) {
		return -EBUSY;
	}

	header_length = snprintf(chunk_header, sizeof(chunk_header), "%x\r\n",
				 (unsigned int)length);
	if (header_length < 0 || (size_t)header_length >= sizeof(chunk_header)) {
		return -EOVERFLOW;
	}
	total = (size_t)header_length + length + 2U;
	if (total > sizeof(stream_pending)) {
		return -EMSGSIZE;
	}

	memcpy(stream_pending, chunk_header, (size_t)header_length);
	memcpy(stream_pending + (size_t)header_length, data, length);
	stream_pending[(size_t)header_length + length] = '\r';
	stream_pending[(size_t)header_length + length + 1U] = '\n';
	stream_pending_len = total;
	stream_pending_off = 0U;
	return 0;
}

static int send_http_chunk_end(int fd)
{
	/* Final chunk must go out reliably; briefly restore blocking. */
	(void)socket_set_nonblock(fd, false);
	return send_all(fd, "0\r\n\r\n", 5U);
}

static int copy_transcript_json_string(void);
static int copy_json_string_value(const char *key, char *output,
				  size_t output_size);

static int finalize_command_response(void)
{
	int error;

	error = copy_transcript_json_string();
	if (error != 0) {
		pendant_cloud_transcribe_result = error;
		return error;
	}

	/* Prefer nested job.jobId from /v1/pendant/command; fall back to jobId. */
	if (copy_json_string_value("jobId", mac_job_id, sizeof(mac_job_id)) ==
	    0) {
		(void)strncpy(transcription_job_id, mac_job_id,
			      sizeof(transcription_job_id) - 1U);
		transcription_job_id[sizeof(transcription_job_id) - 1U] = '\0';
		pendant_cloud_dispatch_result = 0;
		printk("Transcript queued for Mac job %s (live PCM stream)\n",
		       mac_job_id);
		return 0;
	}

	pendant_cloud_dispatch_result = -ENOTCONN;
	printk("PCM upload ok but no Mac job was queued\n");
	return -ENOTCONN;
}

static int send_http_get_header(int fd, const char *path)
{
	char header[HTTP_HEADER_SIZE];
	int length = snprintf(
		header, sizeof(header),
		"GET %s HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Accept: audio/ogg, audio/pcm, application/json\r\n"
		"Connection: close\r\n\r\n",
		path, RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

struct base64_stream {
	int fd;
	uint8_t carry[3];
	uint8_t carry_length;
	char output[BASE64_SEND_SIZE];
	size_t output_length;
};

static int base64_flush(struct base64_stream *stream)
{
	int error;

	if (stream->output_length == 0U) {
		return 0;
	}
	error = send_all(stream->fd, stream->output, stream->output_length);
	if (error == 0) {
		stream->output_length = 0U;
	}
	return error;
}

static int base64_emit(struct base64_stream *stream, uint8_t count)
{
	const uint8_t byte0 = stream->carry[0];
	const uint8_t byte1 = count > 1U ? stream->carry[1] : 0U;
	const uint8_t byte2 = count > 2U ? stream->carry[2] : 0U;

	if (stream->output_length + 4U > sizeof(stream->output)) {
		int error = base64_flush(stream);

		if (error != 0) {
			return error;
		}
	}

	stream->output[stream->output_length++] =
		base64_alphabet[byte0 >> 2];
	stream->output[stream->output_length++] =
		base64_alphabet[((byte0 & 0x03U) << 4) | (byte1 >> 4)];
	stream->output[stream->output_length++] =
		count > 1U
			? base64_alphabet[((byte1 & 0x0fU) << 2) |
					  (byte2 >> 6)]
			: '=';
	stream->output[stream->output_length++] =
		count > 2U ? base64_alphabet[byte2 & 0x3fU] : '=';
	stream->carry_length = 0U;
	return 0;
}

static int base64_feed(struct base64_stream *stream,
		       const uint8_t *data, size_t length)
{
	for (size_t index = 0U; index < length; ++index) {
		stream->carry[stream->carry_length++] = data[index];
		if (stream->carry_length == 3U) {
			int error = base64_emit(stream, 3U);

			if (error != 0) {
				return error;
			}
		}
	}
	return 0;
}

static int base64_finish(struct base64_stream *stream)
{
	int error = 0;

	if (stream->carry_length != 0U) {
		error = base64_emit(stream, stream->carry_length);
	}
	return error == 0 ? base64_flush(stream) : error;
}

/*
 * Fallback: known-length raw s16le PCM file upload on /v1/pendant/command.
 * Live capture prefers pendant_cloud_stream_* chunked path instead.
 */
static int post_recording_command(const char *audio_path,
				  uint32_t source_pcm_bytes,
				  uint32_t sample_rate)
{
	struct fs_dirent entry;
	struct fs_file_t file;
	uint8_t file_bytes[FILE_READ_SIZE];
	uint32_t bytes_read_total = 0U;
	int fd = -1;
	int error;

	error = fs_stat(audio_path, &entry);
	if (error != 0) {
		printk("Cloud upload SD stat failed for %s: %d\n",
		       audio_path, error);
		return error;
	}
	if (entry.type != FS_DIR_ENTRY_FILE || entry.size == 0U ||
	    entry.size > MAX_PCM_BYTES || source_pcm_bytes == 0U) {
		printk("Cloud upload rejected SD file: type=%u size=%u\n",
		       (unsigned int)entry.type, (uint32_t)entry.size);
		return -EINVAL;
	}
	printk("Cloud upload found %u PCM bytes on SD (fallback single-shot)\n",
	       (uint32_t)entry.size);

	int64_t lat_upload_started = k_uptime_get();

