agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	/*
	 * open_relay_socket already retries DNS/cache/bootstrap. One extra
	 * outer attempt recovers from a transient TLS handshake glitch.
	 */
	fd = open_relay_socket();
	if (fd < 0) {
		printk("Cloud upload relay socket open failed (%d); retrying once\n",
		       fd);
		k_msleep(1000);
		fd = open_relay_socket();
	}
	if (fd < 0) {
		printk("Cloud upload could not open relay socket: %d\n", fd);
		return fd;
	}
	int64_t lat_upload_socket_done = k_uptime_get();
	printk("Cloud upload relay socket open after %lld ms (fd=%d)\n",
	       lat_upload_socket_done - lat_upload_started, fd);

	error = send_pendant_command_pcm_header(fd, (size_t)entry.size,
						sample_rate);
	if (error != 0) {
		printk("Cloud upload HTTP header failed: %d\n", error);
		goto out;
	}

	fs_file_t_init(&file);
	error = fs_open(&file, audio_path, FS_O_READ);
	if (error != 0) {
		goto out;
	}

	while (true) {
		ssize_t count = fs_read(&file, file_bytes, sizeof(file_bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			break;
		}
		error = send_all(fd, file_bytes, (size_t)count);
		if (error != 0) {
			break;
		}
		bytes_read_total += (uint32_t)count;
	}
	(void)fs_close(&file);
	if (error != 0) {
		goto out;
	}
	if (bytes_read_total != entry.size) {
		error = -EIO;
		goto out;
	}

	pendant_cloud_uploaded_pcm_bytes = bytes_read_total;
	printk("Uploaded %u raw PCM bytes (fallback single-shot)\n",
	       bytes_read_total);
	int64_t lat_body_sent = k_uptime_get();

	error = receive_http_response(fd);
	printk("LAT upload socket_ms=%lld body_send_ms=%lld "
	       "server_wait_ms=%lld total_ms=%lld body_bytes=%u\n",
	       lat_upload_socket_done - lat_upload_started,
	       lat_body_sent - lat_upload_socket_done,
	       k_uptime_get() - lat_body_sent,
	       k_uptime_get() - lat_upload_started,
	       (uint32_t)entry.size);

out:
	close(fd);
	return error;
}

static int copy_transcript_json_string(void)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *cursor;
	bool escaped = false;

	if (body == NULL) {
		return -EBADMSG;
	}
	key = strstr(body + 4, "\"text\"");
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + sizeof("\"text\"") - 1U, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}

	for (cursor = start + 1; *cursor != '\0'; ++cursor) {
		if (escaped) {
			escaped = false;
			continue;
		}
		if (*cursor == '\\') {
			escaped = true;
			continue;
		}
		if (*cursor == '"') {
			size_t length = (size_t)(cursor - start + 1);

			if (length >= sizeof(transcript_json)) {
				return -E2BIG;
			}
			memcpy(transcript_json, start, length);
			transcript_json[length] = '\0';
			printk("Remote transcript: %s\n", transcript_json);
			return 0;
		}
	}

	return -EBADMSG;
}

static int copy_json_string_value(const char *key_name,
				  char *destination,
				  size_t destination_size)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *end;
	char quoted_key[48];
	int key_length;

	if (body == NULL) {
		return -EBADMSG;
	}
	key_length = snprintf(quoted_key, sizeof(quoted_key), "\"%s\"",
			      key_name);
	if (key_length < 0 || (size_t)key_length >= sizeof(quoted_key)) {
		return -EOVERFLOW;
	}
	key = strstr(body + 4, quoted_key);
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + key_length, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}
	++start;
	end = strchr(start, '"');
	if (end == NULL) {
		return -EBADMSG;
	}

	size_t length = (size_t)(end - start);

	if (length == 0U || length >= destination_size) {
		return length == 0U ? -ENODATA : -E2BIG;
	}
	memcpy(destination, start, length);
	destination[length] = '\0';
	return 0;
}

static int dispatch_transcript_to_mac(uint32_t sample_rate)
{
	char plan_suffix[PLAN_SUFFIX_SIZE];
	const size_t transcript_length = strlen(transcript_json);
	uint32_t duration_ms;
	int suffix_length;
	size_t body_length;
	int fd;
	int error;

	if (sample_rate == 0U) {
		return -EINVAL;
	}
	duration_ms = (uint32_t)(
		((uint64_t)pendant_cloud_uploaded_pcm_bytes * 1000U) /
		((uint64_t)sample_rate * sizeof(int16_t)));
	suffix_length = snprintf(
		plan_suffix, sizeof(plan_suffix),
		",\"deviceId\":\"" PENDANT_DEVICE_ID "\","
		"\"transcriptionJobId\":\"%s\","
			"\"inputTelemetry\":{"
			"\"audioBytes\":%u,"
			"\"format\":\"ogg-opus\","
		"\"sampleRate\":%u,"
		"\"channels\":1,"
		"\"bitsPerSample\":16,"
		"\"inputGainDb\":0,"
		"\"durationMs\":%u,"
		"\"storage\":\"microSD\","
			"\"uploadedFormat\":\"ogg\"}}",
		transcription_job_id, pendant_cloud_uploaded_pcm_bytes,
		sample_rate, duration_ms);
	if (suffix_length < 0 ||
	    (size_t)suffix_length >= sizeof(plan_suffix)) {
		return -EOVERFLOW;
	}

	body_length = sizeof(plan_prefix) - 1U +
		      transcript_length + (size_t)suffix_length;

	int64_t lat_dispatch_started = k_uptime_get();

	fd = open_relay_socket();
	if (fd < 0) {
		return fd;
	}
	int64_t lat_dispatch_socket_done = k_uptime_get();

	error = send_http_post_header(fd, MAC_PLAN_PATH,
				      "application/json", body_length);
	if (error == 0) {
		error = send_all(fd, plan_prefix, sizeof(plan_prefix) - 1U);
	}
	if (error == 0) {
		error = send_all(fd, transcript_json, transcript_length);
	}
	if (error == 0) {
		error = send_all(fd, plan_suffix, (size_t)suffix_length);
	}
	if (error == 0) {
		error = receive_http_response(fd);
	}
	printk("LAT dispatch socket_ms=%lld rest_ms=%lld total_ms=%lld\n",
	       lat_dispatch_socket_done - lat_dispatch_started,
	       k_uptime_get() - lat_dispatch_socket_done,
	       k_uptime_get() - lat_dispatch_started);

	close(fd);
	return error;
}

static int post_pendant_event(const char *stage, const char *status,
			      const char *label, const char *detail,
			      int result)
{
	char path[192];
	char body[PENDANT_EVENT_BODY_SIZE];
	int previous_http_status = pendant_cloud_last_http_status;
	int path_length;
	int body_length;
	int fd;
	int error;

