agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
static int receive_fixed_pcm(struct http_body_reader *reader,
			     struct pcm_writer *writer,
			     size_t content_length)
{
	for (size_t index = 0U; index < content_length; ++index) {
		uint8_t character;
		int error = read_required_body_byte(reader, &character);

		if (error != 0) {
			return error;
		}
		error = pcm_writer_emit(writer, character);
		if (error != 0) {
			return error;
		}
	}
	return 0;
}

static int receive_close_delimited_pcm(struct http_body_reader *reader,
				       struct pcm_writer *writer)
{
	while (true) {
		uint8_t character;
		int result = http_body_next(reader, &character);

		if (result < 0) {
			return result;
		}
		if (result == 0) {
			return 0;
		}
		int error = pcm_writer_emit(writer, character);
		if (error != 0) {
			return error;
		}
	}
}

static char ascii_lower(char value)
{
	return value >= 'A' && value <= 'Z' ? value + ('a' - 'A') : value;
}

static const char *header_find_ci(const char *header, const char *needle)
{
	size_t needle_length = strlen(needle);

	for (const char *candidate = header; *candidate != '\0'; ++candidate) {
		size_t index = 0U;

		while (index < needle_length &&
		       candidate[index] != '\0' &&
		       ascii_lower(candidate[index]) ==
			       ascii_lower(needle[index])) {
			++index;
		}
		if (index == needle_length) {
			return candidate;
		}
	}
	return NULL;
}

static size_t header_decimal_value(const char *header, const char *name)
{
	const char *value = header_find_ci(header, name);

	return value == NULL ? 0U : (size_t)strtoul(value + strlen(name), NULL, 10);
}

static int receive_agent_job_speech(int fd, const char *pcm_path)
{
	char header[HTTP_STREAM_HEADER_SIZE];
	struct fs_file_t file;
	size_t header_bytes = 0U;
	char *body = NULL;
	bool file_open = false;
	int error = 0;

	while (header_bytes < sizeof(header) - 1U) {
		ssize_t received = recv(fd, header + header_bytes,
					sizeof(header) - 1U - header_bytes, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			return -ECONNRESET;
		}
		header_bytes += (size_t)received;
		header[header_bytes] = '\0';
		body = strstr(header, "\r\n\r\n");
		if (body != NULL) {
			break;
		}
	}
	if (body == NULL) {
		return -EOVERFLOW;
	}

	const char *status = strchr(header, ' ');
	if (status == NULL) {
		return -EBADMSG;
	}
	pendant_cloud_last_http_status = atoi(status + 1);
	printk("Agent speech HTTP status: %d\n", pendant_cloud_last_http_status);
	if (pendant_cloud_last_http_status == 202) {
		return -EAGAIN;
	}
	if (pendant_cloud_last_http_status < 200 ||
	    pendant_cloud_last_http_status >= 300) {
		return -EREMOTE;
	}
	bool is_opus =
		header_find_ci(header, "Content-Type: audio/ogg") != NULL ||
		header_find_ci(header, "X-Audio-Format: ogg-opus") != NULL;
	bool is_pcm =
		header_find_ci(header, "Content-Type: audio/pcm") != NULL ||
		header_find_ci(header, "X-Audio-Format: s16le") != NULL;

	if (!is_opus && !is_pcm) {
		return -EBADMSG;
	}
	pendant_cloud_reply_format = is_opus
		? PENDANT_CLOUD_AUDIO_OGG_OPUS
		: PENDANT_CLOUD_AUDIO_PCM_S16LE;

	size_t content_length = header_decimal_value(header, "Content-Length:");
	bool chunked =
		header_find_ci(header, "Transfer-Encoding: chunked") != NULL;
	size_t sample_rate =
		header_decimal_value(header, "X-Audio-Sample-Rate:");
	if (sample_rate != 0U) {
		pendant_cloud_reply_sample_rate = (uint32_t)sample_rate;
	}
	body += 4;
	struct http_body_reader reader = {
		.fd = fd,
		.initial = (const uint8_t *)body,
		.initial_length = header_bytes - (size_t)(body - header),
	};
	struct pcm_writer writer = {
		.file = &file,
	};

	fs_file_t_init(&file);
	error = fs_open(&file, pcm_path,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error != 0) {
		return error;
	}
	file_open = true;
	printk("Agent speech body: chunked=%u content_length=%u\n",
	       chunked ? 1U : 0U, (uint32_t)content_length);

	if (chunked) {
		error = receive_chunked_pcm(&reader, &writer);
	} else if (content_length != 0U) {
		error = receive_fixed_pcm(&reader, &writer, content_length);
	} else {
		error = receive_close_delimited_pcm(&reader, &writer);
	}
	if (error == 0) {
		error = pcm_writer_flush(&writer);
	}
	if (error == 0) {
		error = fs_sync(&file);
	}
	if (file_open) {
		int close_error = fs_close(&file);

		if (error == 0) {
			error = close_error;
		}
	}
	if (error != 0) {
		return error;
	}
	if (writer.written_bytes == 0U ||
	    (is_pcm && (writer.written_bytes & 1U) != 0U)) {
		return -EBADMSG;
	}

	/* Tiny replies: still raise LED if body finished under threshold. */
	if (!writer.first_batch_notified && writer.written_bytes > 0U) {
		writer.first_batch_notified = true;
		pendant_cloud_reply_first_batch = true;
		pendant_notify_reply_first_batch();
	}

	pendant_cloud_reply_pcm_bytes = (uint32_t)writer.written_bytes;
	printk("Downloaded %u bytes of Mac agent speech (%s)%s\n",
	       pendant_cloud_reply_pcm_bytes,
	       is_opus ? "Ogg Opus" : "PCM fallback",
	       pendant_cloud_reply_first_batch ? " [LED already solid]" : "");
	return 0;
}

int pendant_cloud_init(void)
{
	int error;

	if (cloud_initialized) {
		return 0;
	}
	if (CONFIG_PENDANT_RELAY_API_KEY[0] == '\0') {
		printk("PENDANT_RELAY_API_KEY is empty\n");
		pendant_cloud_init_result = -EACCES;
		return pendant_cloud_init_result;
	}

	printk("Initializing nRF9160 modem\n");
	error = nrf_modem_lib_init();
	if (error != 0) {
		printk("nrf_modem_lib_init failed: %d\n", error);
		goto out;
	}
	error = provision_relay_certificate();
	if (error != 0) {
		printk("Relay CA provision failed: %d\n", error);
		goto out;
	}

	/*
	 * UICC often only answers after full functionality (CFUN). Pre-attach
	 * ICCID failure is not fatal; recheck during probes. lte_lc_connect
	 * blocks up to CONFIG_LTE_NETWORK_TIMEOUT (cereg.c).
	 */
	{
		char at_buf[160];

		(void)nrf_modem_at_printf("AT+CEREG=5");
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
				     "AT%%XSIM?") == 0) {
			printk("SIM before CFUN (non-authoritative; %%XSIM: 0 is "
			       "expected here): %s", at_buf);
		}
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
				     "AT%%XICCID") == 0) {
			printk("SIM ICCID before CFUN (non-authoritative): %s",
			       at_buf);
		} else {
			printk("SIM ICCID not ready pre-attach "
			       "(will recheck during attach)\n");
		}
	}

