agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	lte_attach_probe_count = 0U;
	lte_attach_started_ms = k_uptime_get();
	atomic_set(&lte_attach_probe_active, 1);
	k_work_schedule(&lte_attach_probe_work, K_SECONDS(3));

	printk("Attaching pendant to LTE network (timeout %us)\n",
	       (unsigned int)CONFIG_LTE_NETWORK_TIMEOUT);
	error = lte_lc_connect();
	atomic_clear(&lte_attach_probe_active);
	struct k_work_sync probe_sync;

	(void)k_work_cancel_delayable_sync(&lte_attach_probe_work, &probe_sync);
	if (error != 0) {
		bool sim_ready = false;

		printk("LTE attach failed: %d (%s).\n", error,
		       error == -ETIMEDOUT ? "timeout" : "error");
		{
			char at_buf[160];

			if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
					     "AT%%XSIM?") == 0) {
				sim_ready = strstr(at_buf, "%XSIM: 1") != NULL;
				printk("Final SIM (post-CFUN, authoritative): %s",
				       at_buf);
			}
			if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
					     "AT+CEREG?") == 0) {
				printk("Final CEREG: %s", at_buf);
			}
		}
		if (sim_ready) {
			printk("SIM is initialized; check LTE-M coverage, antenna, "
			       "APN/plan, and registration status.\n");
		} else {
			printk("SIM is not initialized post-CFUN; check the nano-SIM "
			       "seat, contacts, tray, and power.\n");
		}
		goto out;
	}
	{
		char at_buf[160];

		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XSIM?") == 0) {
			printk("SIM after attach (post-CFUN, authoritative): %s",
			       at_buf);
		}
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XICCID") == 0) {
			printk("SIM ICCID after attach: %s", at_buf);
		}
	}

	cloud_initialized = true;
	printk("Pendant LTE connection ready (attach %lld s)\n",
	       (k_uptime_get() - lte_attach_started_ms) / 1000);

out:
	pendant_cloud_init_result = error;
	return error;
}

int pendant_cloud_suspend_radio(void)
{
	int error;

	if (!cloud_initialized || radio_suspended) {
		return 0;
	}

	printk("Powering down modem RF for deterministic microphone capture\n");
	error = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_POWER_OFF);
	if (error == 0) {
		radio_suspended = true;
		/*
		 * The AT command returns before the modem's final RF/HFXO rail
		 * transition has fully settled. Starting I2S during that transition
		 * can still starve DMA about one second later.
		 */
		k_msleep(1500);
	}
	return error;
}

int pendant_cloud_resume_radio(void)
{
	int error;

	if (!radio_suspended) {
		return 0;
	}

	printk("Resuming LTE after microphone capture\n");
	error = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_NORMAL);
	if (error != 0) {
		return error;
	}
	radio_suspended = false;

	printk("Reattaching pendant to LTE network\n");
	return lte_lc_connect();
}

static void stream_reset_state(void)
{
	stream_fd = -1;
	stream_active = false;
	stream_sample_rate = 0U;
	stream_bytes_sent = 0U;
	stream_started_ms = 0;
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	stream_pump_calls = 0U;
	stream_eagain_count = 0U;
	stream_chunks_completed = 0U;
}

/*
 * True when the prewarmed fd still looks usable. Peer close/RST shows up as
 * POLLHUP/POLLERR. Any POLLIN on a half-open chunked POST (headers sent, body
 * not finished) means FIN/RST/unexpected response — do not reuse.
 */
static bool stream_socket_ok(void)
{
	struct zsock_pollfd pfd;
	int n;

	if (stream_fd < 0) {
		return false;
	}

	memset(&pfd, 0, sizeof(pfd));
	pfd.fd = stream_fd;
	pfd.events = ZSOCK_POLLIN;
	n = zsock_poll(&pfd, 1, 0);
	if (n < 0) {
		return false;
	}
	if ((pfd.revents & (ZSOCK_POLLIN | ZSOCK_POLLERR | ZSOCK_POLLHUP |
			    ZSOCK_POLLNVAL)) != 0) {
		return false;
	}
	return true;
}

static bool stream_is_conn_death(int error)
{
	return error == -ECONNRESET || error == -EPIPE || error == -ENOTCONN ||
	       error == -ECONNABORTED || error == -ENETRESET ||
	       error == -EHOSTUNREACH || error == -ENETUNREACH ||
	       error == -ETIMEDOUT;
}

bool pendant_cloud_stream_active(void)
{
	return stream_active;
}

bool pendant_cloud_stream_has_pending(void)
{
	return stream_pending_len != 0U;
}

uint32_t pendant_cloud_stream_bytes_sent(void)
{
	return stream_bytes_sent;
}

void pendant_cloud_stream_abort(void)
{
	if (stream_fd >= 0) {
		close(stream_fd);
	}
	stream_reset_state();
}

static int stream_open_chunked(uint32_t sample_rate)
{
	int error;

	if (sample_rate == 0U) {
		return -EINVAL;
	}
	if (!cloud_initialized) {
		error = pendant_cloud_init();
		if (error != 0) {
			return error;
		}
	}
	if (radio_suspended) {
		error = pendant_cloud_resume_radio();
		if (error != 0) {
			return error;
		}
	}

	stream_started_ms = k_uptime_get();
	error = open_relay_socket();
	if (error < 0) {
		printk("Live PCM stream socket failed (%d); retrying once\n",
		       error);
		k_msleep(500);
		error = open_relay_socket();
	}
	if (error < 0) {
		printk("Live PCM stream socket failed: %d\n", error);
		stream_reset_state();
		return error;
	}
	stream_fd = error;

	/* Headers use blocking send (idle/prewarm only). */
	error = send_pendant_command_chunked_header(stream_fd, sample_rate);
	if (error != 0) {
		printk("Live PCM stream header failed: %d\n", error);
		close(stream_fd);
		stream_reset_state();
		return error;
	}

	error = socket_set_nonblock(stream_fd, true);
	if (error != 0) {
		printk("Live PCM stream nonblock failed: %d\n", error);
		/* Continue with blocking; pump still time-bounds loops. */
	}

	stream_active = true;
	stream_sample_rate = sample_rate;
	stream_bytes_sent = 0U;
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	stream_chunks_completed = 0U;
	/* stream_started_ms set above at open start — age for stale checks. */
	printk("Live PCM stream open: sample_rate=%u header_ms=%lld\n",
	       sample_rate, k_uptime_get() - stream_started_ms);
	return 0;
}

/*
 * Drop a dead/stale half-open session and open a fresh TLS+chunked stream.
 * Clears any in-flight pending frame (caller must tolerate losing that stage).
 */
static void stream_reset_job_state(void)
{
	pendant_cloud_transcribe_result = -EAGAIN;
	pendant_cloud_dispatch_result = -EAGAIN;
	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_last_http_status = 0;
	pendant_cloud_uploaded_pcm_bytes = 0U;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	transcription_job_id[0] = '\0';
	mac_job_id[0] = '\0';
	announced_job_id[0] = '\0';
}

static int stream_reopen_fresh(uint32_t sample_rate, const char *reason)
{
	printk("Live PCM stream reopen (%s)\n",
	       reason != NULL ? reason : "refresh");
	if (stream_fd >= 0) {
		close(stream_fd);
	}
	stream_reset_state();
	stream_reset_job_state();
	return stream_open_chunked(sample_rate);
}

