agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
/*
 * Open TLS + chunked headers while the UI is idle so Button 1 never waits on
 * the modem handshake. Safe to call repeatedly. Refreshes aged/dead sockets so
 * a long wait between prewarm and press does not leave a RST-pending fd.
 */
int pendant_cloud_stream_prewarm(uint32_t sample_rate)
{
	int error;

	if (stream_active && stream_sample_rate == sample_rate) {
		int64_t age_ms = k_uptime_get() - stream_started_ms;
		bool ok = stream_socket_ok();

		if (age_ms < STREAM_MAX_IDLE_MS && ok) {
			return 0;
		}
		printk("Live PCM idle refresh (age_ms=%lld socket_ok=%d)\n",
		       age_ms, ok ? 1 : 0);
		error = stream_reopen_fresh(sample_rate, "idle_refresh");
	} else {
		if (stream_active) {
			pendant_cloud_stream_abort();
		}
		stream_reset_job_state();
		error = stream_open_chunked(sample_rate);
	}
	if (error == 0) {
		printk("Live PCM stream prewarmed (idle)\n");
	}
	return error;
}

/*
 * Call at button press before I2S starts. Reopens if the idle prewarm is
 * stale or the modem socket already shows POLLHUP/RST.
 */
int pendant_cloud_stream_ensure(uint32_t sample_rate)
{
	int error;

	if (stream_active && stream_sample_rate == sample_rate) {
		int64_t age_ms = k_uptime_get() - stream_started_ms;
		bool ok = stream_socket_ok();

		if (age_ms < STREAM_STALE_AT_START_MS && ok) {
			stream_reset_job_state();
			printk("Live PCM stream ready at press (age_ms=%lld)\n",
			       age_ms);
			return 0;
		}
		printk("Live PCM stream not ready at press "
		       "(age_ms=%lld socket_ok=%d); reopening\n",
		       age_ms, ok ? 1 : 0);
		error = stream_reopen_fresh(sample_rate, "press_ensure");
	} else {
		if (stream_active) {
			pendant_cloud_stream_abort();
		}
		stream_reset_job_state();
		error = stream_open_chunked(sample_rate);
	}
	if (error == 0) {
		printk("Live PCM stream ensured at press\n");
	} else {
		printk("Live PCM stream ensure failed: %d\n", error);
	}
	return error;
}

int pendant_cloud_stream_begin(uint32_t sample_rate)
{
	return pendant_cloud_stream_ensure(sample_rate);
}

int pendant_cloud_stream_pump(uint32_t budget_ms)
{
	int64_t deadline;
	int error;

	++stream_pump_calls;
	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}
	if (stream_pending_len == 0U) {
		return 0;
	}
	deadline = k_uptime_get() + (int64_t)budget_ms;
	error = stream_pending_pump(deadline);
	/*
	 * Do not TLS-reopen here: I2S only has ~123 ms of RX slab headroom and
	 * a modem handshake can take hundreds of ms to seconds. Stale sockets
	 * are handled by idle prewarm refresh + ensure-at-press.
	 */
	if (error != 0 && error != -EAGAIN && stream_is_conn_death(error)) {
		printk("Live PCM pump conn death: %d chunks_done=%u "
		       "pending_off=%u (SD backup if armed)\n",
		       error, stream_chunks_completed,
		       (unsigned int)stream_pending_off);
	}
	return error;
}

int pendant_cloud_stream_write(const void *data, size_t length)
{
	int error;

	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}
	if (data == NULL || length == 0U) {
		return 0;
	}
	if (stream_bytes_sent + length > MAX_PCM_BYTES) {
		return -EFBIG;
	}
	/* Must finish previous chunk framing before queueing another. */
	if (stream_pending_len != 0U) {
		return -EAGAIN;
	}

	error = stream_queue_http_chunk(data, length);
	if (error != 0) {
		return error;
	}
	/* Bytes are committed once framed; pump may finish later. */
	stream_bytes_sent += (uint32_t)length;
	return 0;
}

int pendant_cloud_stream_end(void)
{
	int error;
	int64_t body_done_ms;
	int64_t drain_deadline;

	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}

	/* Drain any in-flight chunk (budget up to 5 s). */
	drain_deadline = k_uptime_get() + 5000;
	while (stream_pending_len != 0U) {
		error = stream_pending_pump(drain_deadline);
		if (error == -EAGAIN) {
			if (k_uptime_get() >= drain_deadline) {
				printk("Live PCM stream drain timeout\n");
				pendant_cloud_stream_abort();
				pendant_cloud_transcribe_result = -ETIMEDOUT;
				return -ETIMEDOUT;
			}
			continue;
		}
		if (error != 0) {
			printk("Live PCM stream drain failed: %d\n", error);
			pendant_cloud_stream_abort();
			pendant_cloud_transcribe_result = error;
			return error;
		}
	}

	error = send_http_chunk_end(stream_fd);
	if (error != 0) {
		printk("Live PCM stream end-chunk failed: %d\n", error);
		pendant_cloud_stream_abort();
		pendant_cloud_transcribe_result = error;
		return error;
	}

	pendant_cloud_uploaded_pcm_bytes = stream_bytes_sent;
	body_done_ms = k_uptime_get();
	printk("Live PCM stream body complete: bytes=%u stream_ms=%lld "
	       "pumps=%u eagain=%u\n",
	       stream_bytes_sent, body_done_ms - stream_started_ms,
	       stream_pump_calls, stream_eagain_count);

	(void)socket_set_nonblock(stream_fd, false);
	error = receive_http_response(stream_fd);
	printk("LAT live_stream server_wait_ms=%lld total_ms=%lld "
	       "body_bytes=%u HTTP=%d\n",
	       k_uptime_get() - body_done_ms,
	       k_uptime_get() - stream_started_ms, stream_bytes_sent,
	       pendant_cloud_last_http_status);

	close(stream_fd);
	stream_fd = -1;
	stream_active = false;

	pendant_cloud_transcribe_result = error;
	if (error != 0) {
		stream_reset_state();
		return error;
	}

	error = finalize_command_response();
	stream_reset_state();
	return error;
}

int pendant_cloud_upload_recording(const char *audio_path,
				   uint32_t source_pcm_bytes,
				   uint32_t sample_rate)
{
	int error;

	if (stream_active) {
		pendant_cloud_stream_abort();
	}

	pendant_cloud_transcribe_result = -EAGAIN;
	pendant_cloud_dispatch_result = -EAGAIN;
	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_last_http_status = 0;
	pendant_cloud_uploaded_pcm_bytes = 0U;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	transcription_job_id[0] = '\0';
	mac_job_id[0] = '\0';
	announced_job_id[0] = '\0';

	if (!cloud_initialized) {
		error = pendant_cloud_init();
		if (error != 0) {
			return error;
		}
	}

	/*
	 * Fallback: one TLS session, raw PCM file, relay STT + Mac queue.
	 */
	error = post_recording_command(audio_path, source_pcm_bytes,
				       sample_rate);
	pendant_cloud_transcribe_result = error;
	if (error != 0) {
		return error;
	}

	return finalize_command_response();
}

int pendant_cloud_wait_for_agent_reply(const char *pcm_path)
{
	char path[192];
	int error;

	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	pendant_cloud_reply_first_batch = false;
	if (!cloud_initialized || mac_job_id[0] == '\0') {
		pendant_cloud_reply_result = -ENODATA;
		return pendant_cloud_reply_result;
	}

